flameExtinction/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (-0.8 0.0 -0.5)  //0
    ( 0.8 0.0 -0.5)  //1
    ( 0.8 2.0 -0.5)  //2
    (-0.8 2.0 -0.5)  //3

    (-0.8 0.0 0.5)  //4
    ( 0.8 0.0 0.5)  //5
    ( 0.8 2.0 0.5)  //6
    (-0.8 2.0 0.5)  //7
 );

blocks          
(
    hex (0 1 2 3 4 5 6 7) (64 60 40) simpleGrading (1 1.5 1)  //25mm cells
);

edges           
(

);

patches         
(
    patch open 
    (
      (0 1 5 4)
      (0 4 7 3)
      (4 5 6 7)
      (5 1 2 6)
      (1 0 3 2) 
    )

    patch outlet
    (
      (3 7 6 2) 
    )
);

mergePatchPairs
(  
    
);

// ************************************************************************* //
