flameExtinction/system/controlDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     fireFoam;

startFrom       latestTime;

startTime       0.0;

stopAt          endTime;

endTime         40.01;

deltaT          0.003;

writeControl    adjustableRunTime;

writeInterval   20;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression on;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.9;

maxDeltaT       0.01;

functions
{
/*
    HRR
    {
        type               cellSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled            true;
        outputControl      runTime; //outputTime;
        writeInterval      0.005;
        log                false;     
        valueOutput        false;
        source             all;       //cellZone;
        sourceName         c0;
        operation          volIntegrate;
        fields
        (
            dQ
        );
    }

    HRR_burner
    {
        type               faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled            true;
        outputControl      runTime; //outputTime; 
        writeInterval      0.005;
        log                false;
        valueOutput        false;
        source             patch;
        sourceName         burner;
        operation          sum;
        fields
        (
            phi
            HRR_fu
        );
    }

    Qr_burner
    {
        type                faceSource;
        functionObjectLibs  ("libfieldFunctionObjects.so");
        enabled             true;
        outputControl       runTime; //outputTime; 
        writeInterval       0.005;
        log                 false;
        valueOutput         false;
        source              patch;
        sourceName          burner;
        operation           areaIntegrate;
        fields
        (
            Qr
        );
    }

    Qr_blockage
    {
        type                faceSource;
        functionObjectLibs  ("libfieldFunctionObjects.so");
        enabled             true;
        outputControl       runTime; //outputTime; 
        writeInterval       0.005;
        log                 false;
        valueOutput         false;
        source              patch;
        sourceName          blockage;
        operation           areaIntegrate;
        fields
        (
            Qr
        );
    }

    Qr_coflow
    {
        type                faceSource;
        functionObjectLibs  ("libfieldFunctionObjects.so");
        enabled             true;
        outputControl       runTime; //outputTime; 
        writeInterval       0.005;
        log                 false;
        valueOutput         false;
        source              patch;
        sourceName          coflow;
        operation           areaIntegrate;
        fields
        (
            Qr
        );
    }

    Qr_open
    {
        type                faceSource;
        functionObjectLibs  ("libfieldFunctionObjects.so");
        enabled             true;
        outputControl       runTime; //outputTime; 
        writeInterval       0.005;
        log                 false;
        valueOutput         false;
        source              patch;
        sourceName          open;
        operation           areaIntegrate;
        fields
        (
            Qr
        );
    }

    Qr_outlet
    {
        type                faceSource;
        functionObjectLibs  ("libfieldFunctionObjects.so");
        enabled             true;
        outputControl       runTime; //outputTime; 
        writeInterval       0.005;
        log                 false;
        valueOutput         false;
        source              patch;
        sourceName          outlet;
        operation           areaIntegrate;
        fields
        (
            Qr
        );
    }
*/

    partialWrite
    {
        type            writeRegisteredObject;

        // Where to load it from
        functionObjectLibs ("libIOFunctionObjects.so");

        // Execute upon options:
        //  timeStep
        //  outputTime
        //  adjustableTime
        //  runTime
        //  clockTime
        //  cpuTime
        outputControl   adjustableTime;

        // Objects (fields or lagrangian fields in any of the clouds)
        // to write every outputTime
        objectNames    (rho U T O2 N2);

        exclusiveWriting     false;

        // Interval of time (sec) to write down(
        writeInterval   0.1; //(adjustableTime, runTime, clockTime, cpuTime)
    }

}

// ************************************************************************* //
